public class Task4 {
    /*
    имеется таблица с 1 полем, заполненная числами по порядку: {1,2,4,7,8,11..}.
Написать SQL Запрос который делает выборку следующего вида (2 столбца): {{3,1},{5,2},...},
 Т.е. в первом поле идет число, с которого начинается пропуск, во втором количество пропущенных чисел.
     */


    /*
    todo: сделать так, чтобы выводились не только пропущенные числа, но и количество пропусков.

    В данный момент не знаю как это сделать, потому функционал следующий:
    1. Создается временная таблица, заполненная случайными числами от 1 до 20.
    2. Создается тестовая таблица, заполняется уникальными значениями из временной таблицы,
     включая некоторое количество пропусков чисел.
    3. Создается заполненная таблица - образец, включающая числа от 1 до 20.
    4. Происходит внешнее левое соединение таблицы-образца с тестовой, условие выборки - пропуски чисел в тестовой таблице.

    Скрипты написаны в PostgreSQL 11.
    Скрипты для БД находятся в директории db, находящейся в корне проекта.
    Список скриптов:
    1. Скрипт создания бд и наполнение его данными - schema.sql
    2. Скрипт выборки пропущенных чисел - solution.sql
     */
}
